app/controllers/contacts_controller.rb

SELECT * FROM "contacts"
---
  def index
    @contacts = Contact.all

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("created_at", "updated_at", "email") VALUES('2010-04-09 18:59:54', '2010-04-09 18:59:54', 'edu')
---
  def create
    @contact = Contact.new(params[:contact])
    if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
DELETE FROM "contacts" WHERE "id" = 1
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy